zpq001/mdr32f9q-ps200w/source/src/eeprom.c
	// Overload
	device_profile->converter_profile.overload.protection_enable = Converter_GetOverloadProtectionState();
	device_profile->converter_profile.overload.warning_enable = Converter_GetOverloadProtectionWarning();
	device_profile->converter_profile.overload.threshold = Converter_GetOverloadProtectionThreshold();
	
	// Other fields
	// ...
}



//=================================================================//
//	Load routines (from EEPROM)
//=================================================================//



//-------------------------------------------------------//
// Return:
//		EE_GSETTINGS_HW_ERROR if there was an hardware error for global settings
//  	EE_GSETTINGS_CRC_ERROR if there was CRC error for global settings
//-------------------------------------------------------//
static uint8_t EE_LoadGlobalSettings(void)
{
	uint8_t err_code = EE_OK;
	uint8_t hw_result;
	uint16_t crc;
	uint16_t ee_crc;
	uint16_t ee_addr;
	
	//-------------------------------//
	//	Read global settings
	ee_addr = EE_GSETTINGS_BASE;
	hw_result = EEPROM_ReadBlock(ee_addr, (uint8_t *)&global_settings_data, sizeof(global_settings_t));
	ee_addr = EE_GSETTINGS_BASE + EE_GSETTINGS_CRC_OFFSET;
	hw_result |= EEPROM_ReadBlock(ee_addr, (uint8_t *)&ee_crc, EE_CRC_SIZE);
	if (hw_result == 0)
	{
		// Hardware EEPROM access OK. Check CRC.
		crc = get_crc16((uint8_t *)&global_settings_data, sizeof(global_settings_t), 0xFFFF);
		if (crc != ee_crc)
		{
			// Global settings CRC is broken.
			err_code |= EE_GSETTINGS_CRC_ERROR;
		}	
	}
	else
	{
		// EEPROM hardware error. Cannot access device.
		err_code |= EE_GSETTINGS_HW_ERROR;
	}
	return err_code;
}


//-------------------------------------------------------//
// Profile name for recent profile is ignored
// Return:
//		EE_PROFILE_HW_ERROR if there was an hardware error for recent profile
//		EE_PROFILE_CRC_ERROR if there was CRC error for recent profile
//-------------------------------------------------------//
static uint8_t EE_LoadRecentProfile(void)
{
	uint8_t err_code = EE_OK;
	uint8_t hw_result;
	uint16_t crc;
	uint16_t ee_crc;
	uint16_t ee_addr;
	
	//-------------------------------//
	//	Read recent profile
	ee_addr = EE_RECENT_PROFILE_BASE;
	hw_result = EEPROM_ReadBlock(ee_addr, (uint8_t *)&device_profile_data, sizeof(device_profile_t));
	ee_addr = EE_RECENT_PROFILE_BASE + EE_PROFILE_CRC_OFFSET;
	hw_result |= EEPROM_ReadBlock(ee_addr, (uint8_t *)&ee_crc, EE_CRC_SIZE);
	if (hw_result == 0)
	{
		// Hardware EEPROM access OK. Check CRC.
		crc = get_crc16((uint8_t *)&device_profile_data, sizeof(device_profile_t), 0xFFFF);
		if (crc != ee_crc)
		{
			// Profile CRC is broken.
			err_code |= EE_PROFILE_CRC_ERROR;
		}
	}
	else
	{
		// EEPROM hardware error. Cannot access device.
		err_code |= EE_PROFILE_HW_ERROR;
	}
	return err_code;
}


//-------------------------------------------------------//
// Loads data from specified profile into device_profile_data structure
//
//
//-------------------------------------------------------//
static uint8_t EE_LoadDeviceProfile(uint8_t i)
{	
	uint8_t err_code;
	uint8_t hw_result;
	uint16_t crc;
	uint16_t ee_crc;
	uint16_t ee_addr;
	
	if (i < EE_PROFILES_COUNT) 
	{
		ee_addr = EE_PROFILES_BASE + (i * EE_PROFILE_SIZE);
		hw_result = EEPROM_ReadBlock(ee_addr, (uint8_t *)&device_profile_data, sizeof(device_profile_t));
		ee_addr = EE_PROFILES_BASE + (i * EE_PROFILE_SIZE) + EE_PROFILE_NAME_OFFSET;
		hw_result |= EEPROM_ReadBlock(ee_addr, (uint8_t *)&device_profile_name, EE_PROFILE_NAME_SIZE);
		ee_addr = EE_PROFILES_BASE + (i * EE_PROFILE_SIZE) + EE_PROFILE_CRC_OFFSET;
		hw_result |= EEPROM_ReadBlock(ee_addr, (uint8_t *)&ee_crc, EE_CRC_SIZE);
		if (hw_result == 0)
		{
			// Hardware EEPROM access OK. Check CRC.
			crc = get_crc16((uint8_t *)&device_profile_data, sizeof(device_profile_t), 0xFFFF);
			crc = get_crc16((uint8_t *)&device_profile_name, EE_PROFILE_NAME_SIZE, crc);
			if (crc == ee_crc)
			{
				// Profile CRC is OK.
				profile_info[i] = EE_PROFILE_VALID;
				err_code = EE_OK;
			}	
			else
			{
				// Profile CRC is broken.
				profile_info[i] = EE_PROFILE_CRC_ERROR;
				err_code = EE_PROFILE_CRC_ERROR;
			}
		}
		else
		{
			// EEPROM hardware error. Cannot access device.
			profile_info[i] = EE_PROFILE_HW_ERROR;
			err_code = EE_PROFILE_HW_ERROR;
		}
	}
	else
	{
		// Wrong profile number
		err_code = EE_WRONG_ARGUMENT;
	}	
	return err_code;
}



//-------------------------------------------------------//
// Return:
//		none
//-------------------------------------------------------//
static void EE_ExamineProfiles(void)
{
	uint8_t hw_result;
	uint16_t crc;
	uint16_t ee_crc;
	uint16_t ee_addr;
	uint8_t i;
	
	//-------------------------------//
	//	Read profiles and fill info structure
	for (i=0; i<EE_PROFILES_COUNT; i++)
	{
		ee_addr = EE_PROFILES_BASE + (i * EE_PROFILE_SIZE);
		hw_result = EEPROM_ReadBlock(ee_addr, (uint8_t *)&device_profile_data, sizeof(device_profile_t));
		ee_addr = EE_PROFILES_BASE + (i * EE_PROFILE_SIZE) + EE_PROFILE_NAME_OFFSET;
		hw_result |= EEPROM_ReadBlock(ee_addr, (uint8_t *)&device_profile_name, EE_PROFILE_NAME_SIZE);
		ee_addr = EE_PROFILES_BASE + (i * EE_PROFILE_SIZE) + EE_PROFILE_CRC_OFFSET;
		hw_result |= EEPROM_ReadBlock(ee_addr, (uint8_t *)&ee_crc, EE_CRC_SIZE);
		if (hw_result == 0)
		{
			// Hardware EEPROM access OK. Check CRC.
			crc = get_crc16((uint8_t *)&device_profile_data, sizeof(device_profile_t), 0xFFFF);
			crc = get_crc16((uint8_t *)&device_profile_name, EE_PROFILE_NAME_SIZE, crc);
			if (crc == ee_crc)
			{
				// Profile CRC is OK.
				profile_info[i] = EE_PROFILE_VALID;
			}	
			else
			{
				// Profile CRC is broken.
				profile_info[i] = EE_PROFILE_CRC_ERROR;
			}
		}
		else
		{
			// EEPROM hardware error. Cannot access device.
			profile_info[i] = EE_PROFILE_HW_ERROR;
		}
	}	
}



//-------------------------------------------------------//
//	Returns name of a profile
//	profile_info[i] must be filled correctly before calling.
//	Function always read EE_PROFILE_NAME_SIZE characters from EEPROM
//	filled string is always terminated with \0
//-------------------------------------------------------//
static uint8_t EE_GetProfileName(uint8_t i, char *str_to_fill)
{
	uint8_t err_code;
	uint8_t hw_result;
	uint16_t ee_addr;
	
	if (i < EE_PROFILES_COUNT) 
	{
		if (profile_info[i] == EE_PROFILE_VALID)
		{
			ee_addr = EE_PROFILES_BASE + (i * EE_PROFILE_SIZE) + EE_PROFILE_NAME_OFFSET;
			hw_result = EEPROM_ReadBlock(ee_addr, (uint8_t *)str_to_fill, EE_PROFILE_NAME_SIZE);
			if (hw_result == 0)
			{
				// Hardware EEPROM access OK.
				err_code = EE_OK;
			}
			else
			{
				// EEPROM hardware error. Cannot access device.
				profile_info[i] = EE_PROFILE_HW_ERROR;
				err_code = EE_PROFILE_HW_ERROR;
			}
		}
		else if (profile_info[i] == EE_PROFILE_CRC_ERROR)
		{
			err_code = EE_PROFILE_CRC_ERROR;
		}
		else
		{
			err_code = EE_PROFILE_HW_ERROR;
		}
	}
	else
	{
		// Wrong profile number
		err_code = EE_WRONG_ARGUMENT;
	}	
	return err_code;
}



//=================================================================//
//	Saving routines (to EEPROM)
//=================================================================//



//-------------------------------------------------------//
// Saves global settings to EEPROM
//
//-------------------------------------------------------//
uint8_t EE_SaveGlobalSettings(void)
{
	uint8_t err_code = EE_OK;
	uint8_t hw_result;
	uint16_t crc;
	
	update_global_settings();
	crc = get_crc16((uint8_t *)&global_settings_data, sizeof(global_settings_t), 0xFFFF);
	
