zpq001/mdr32f9q-ps200w/source/src/eeprom.c
	//-------------------------------//
	//	Write global settings
	hw_result = EEPROM_WriteBlock(EE_GSETTINGS_BASE, (uint8_t *)&global_settings_data, sizeof(global_settings_t));
	hw_result |= EEPROM_WriteBlock(EE_GSETTINGS_BASE + EE_GSETTINGS_CRC_OFFSET, (uint8_t *)&crc, EE_CRC_SIZE);
	if (hw_result != 0)
	{
		// EEPROM hardware error. Cannot access device.
		err_code = EE_GSETTINGS_HW_ERROR;
	}
	return err_code;
}


//-------------------------------------------------------//
// Saves recent profile to EEPROM
//
//-------------------------------------------------------//
uint8_t EE_SaveRecentProfile(void)
{
	uint8_t err_code = EE_OK;
	uint8_t hw_result;
	uint16_t crc;
	
	if (global_settings->saveRecentProfile)
	{
		// Profile save is required
		update_device_profile();
		crc = get_crc16((uint8_t *)&device_profile_data, sizeof(device_profile_t), 0xFFFF);

		//-------------------------------//
		//	Write recent profile
		hw_result = EEPROM_WriteBlock(EE_RECENT_PROFILE_BASE, (uint8_t *)&device_profile_data, sizeof(device_profile_t));
		hw_result |= EEPROM_WriteBlock(EE_RECENT_PROFILE_BASE + EE_PROFILE_CRC_OFFSET, (uint8_t *)&crc, EE_CRC_SIZE);
		if (hw_result != 0)
		{
			// EEPROM hardware error. Cannot access device.
			err_code = EE_PROFILE_HW_ERROR;
		}
	}
	else
	{
		// Profile save is NOT required
		err_code = EE_NOT_REQUIRED;
	}
	return err_code;
}




//-------------------------------------------------------//
// Saves profile to EEPROM
//
//-------------------------------------------------------//
static uint8_t EE_SaveDeviceProfile(uint8_t i, char *name)
{	
	uint8_t err_code;
	uint8_t hw_result;
	uint16_t crc;
	uint16_t ee_addr;
	
	if (i < EE_PROFILES_COUNT) 
	{
		// Device profile data structure must be filled before saving by
		// calling update_device_profile();
		
		// Fill temporary buffer with \0
		memset(device_profile_name, 0, sizeof(device_profile_name));
		// Copy name (first EE_PROFILE_NAME_SIZE - 1 characters or until \0 is found in source name)
		// Profile name always contains teminating \0
		strncpy(device_profile_name, name, EE_PROFILE_NAME_SIZE - 1);
		
		crc = get_crc16((uint8_t *)&device_profile_data, sizeof(device_profile_t), 0xFFFF);
		crc = get_crc16((uint8_t *)&device_profile_name, EE_PROFILE_NAME_SIZE, crc);

		//-------------------------------//
		//	Write profile
		ee_addr = EE_PROFILES_BASE + (i * EE_PROFILE_SIZE);
		hw_result = EEPROM_WriteBlock(ee_addr, (uint8_t *)&device_profile_data, sizeof(device_profile_t));
		ee_addr = EE_PROFILES_BASE + (i * EE_PROFILE_SIZE) + EE_PROFILE_NAME_OFFSET;
		hw_result |= EEPROM_WriteBlock(ee_addr, (uint8_t *)&device_profile_name, EE_PROFILE_NAME_SIZE);
		ee_addr = EE_PROFILES_BASE + (i * EE_PROFILE_SIZE) + EE_PROFILE_CRC_OFFSET;
		hw_result |= EEPROM_WriteBlock(ee_addr, (uint8_t *)&crc, EE_CRC_SIZE);
		
		if (hw_result == 0)
		{
			err_code = EE_OK;
			profile_info[i] = EE_PROFILE_VALID;
		}
		else
		{
			// EEPROM hardware error. Cannot access device.
			err_code = EE_PROFILE_HW_ERROR;
			profile_info[i] = EE_PROFILE_HW_ERROR;
		}
	}
	else
	{
		// Wrong profile number
		err_code = EE_WRONG_ARGUMENT;
	}
	return err_code;
}





//=================================================================//
//	Interface routines 
//=================================================================//



uint8_t EE_GetProfileState(uint8_t i)
{
	uint8_t err_code;
	if (i < EE_PROFILES_COUNT) 
	{
		err_code = profile_info[i];
	}
	else
	{
		// Wrong profile number
		err_code = EE_WRONG_ARGUMENT;
	}
	return err_code;
}


uint8_t EE_IsRecentProfileSavingEnabled(void)
{
	return global_settings->saveRecentProfile;
}

uint8_t EE_IsRecentProfileRestoreEnabled(void)
{
	return global_settings->restoreRecentProfile;
}

void EE_ApplyProfileSettings(uint8_t saveRecentProfile, uint8_t restoreRecentProfile)
{
	if ((restoreRecentProfile == 0) && (saveRecentProfile == 1))
	{
		// Saving profile without restoring is useless
		saveRecentProfile = 0;
	} 
	taskENTER_CRITICAL();
	global_settings->saveRecentProfile = saveRecentProfile;
	global_settings->restoreRecentProfile = restoreRecentProfile;
	taskEXIT_CRITICAL();
}



/*
EEPROM settings:

	- save or not device global settings on POFF		<- always enabled
	- save or not device profile on POFF

	- load global settings from EEPROM upon start		<- always enabled
	- load recent profile or default settings upon start

*/






xQueueHandle xQueueEEPROM;

static eeprom_message_t msg;
static dispatch_msg_t dispatcher_msg;


void vTaskEEPROM(void *pvParameters) 
{
	uint8_t state;
	
	// Initialize
	xQueueEEPROM = xQueueCreate( 10, sizeof( eeprom_message_t ) );		// Queue can contain 10 elements
	if( xQueueEEPROM == 0 )
	{
		// Queue was not created and must not be used.
		while(1);
	}
	
	
	while(1)
	{
		xQueueReceive(xQueueEEPROM, &msg, portMAX_DELAY);
		switch (msg.type)
		{
			case EE_TASK_INITIAL_LOAD:
				// Always restore global settings
				state = EE_LoadGlobalSettings();
				if (state & (EE_GSETTINGS_HW_ERROR | EE_GSETTINGS_CRC_ERROR))
				{
					fill_global_settings_by_default();
				}
				// The following function uses profile data structure, so call it before
				// restoring recent profile
				EE_ExamineProfiles();
				
				// Restore recent profile
				if (global_settings->restoreRecentProfile)
				{
					state |= EE_LoadRecentProfile();
					if (state & (EE_PROFILE_HW_ERROR | EE_PROFILE_CRC_ERROR))
					{
						fill_device_profile_by_default();
					}
				}
				else
				{
					// Profile restore is not required. Use defaults.
					fill_device_profile_by_default();
				}
				// Provide feedback
				*msg.initial_load.state = state;
				// Confirm operation
				if (msg.xSemaphorePtr != 0)
				{
					xSemaphoreGive(*msg.xSemaphorePtr);		
				}
				break;
				
			case EE_TASK_GET_PROFILE_NAME:
				*msg.profile_name_request.state = EE_GetProfileName(msg.profile_name_request.index, msg.profile_name_request.name);
				if (msg.xSemaphorePtr != 0)
				{
					// Confirm
					xSemaphoreGive(*msg.xSemaphorePtr);		
				}
				break;
			
			case EE_TASK_LOAD_PROFILE:
				dispatcher_msg.type = DISPATCHER_LOAD_PROFILE_RESPONSE;
				dispatcher_msg.profile_load_response.profileState = EE_GetProfileState(msg.profile_load_request.index);
				if (dispatcher_msg.profile_load_response.profileState == EE_PROFILE_VALID)
				{
					dispatcher_msg.profile_load_response.profileState = EE_LoadDeviceProfile(msg.profile_load_request.index);
				}
				// Confirm
				dispatcher_msg.profile_load_response.index = msg.profile_load_request.index;	// return passed index
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, portMAX_DELAY);		
				break;
			
			case EE_TASK_SAVE_PROFILE:
				// Gather system state
				update_device_profile();
				if (msg.xSemaphorePtr != 0)
				{
					// Confirm
					xSemaphoreGive(*msg.xSemaphorePtr);		
				}
				// Save to EEPROM device
				dispatcher_msg.type = DISPATCHER_SAVE_PROFILE_RESPONSE;
				dispatcher_msg.profile_save_response.profileState = EE_SaveDeviceProfile(msg.profile_save_request.index, msg.profile_save_request.newName);
				dispatcher_msg.profile_save_response.index = msg.profile_save_request.index;	// return passed index
				xQueueSendToBack(xQueueDispatcher, &dispatcher_msg, portMAX_DELAY);	
				break;
		}
	}
}




